
# 모듈이란?
#   파이썬에서는 한 번 정의했던 변수나 함수, 클래스 등을 다른 파이썬 프로그램에서도
#   손쉽게 불러와서 사용할 수 있도록 하나의 파일로 모아놓는 방법 제공,
#   이것을 모듈이라 부름
# - 모듈은 파이썬 프로그램에서 사용할 수 있는 여러정의들과 실행 가능한 구문들을 담고있는
#   하나의 파이썬 파일.py파일로써 기본적으로 제공하는 모듈뿐아니라
#   다른 개발자들이 직접 만든 모듈 사용하거나
#   자신이 직접 새로운 모듈을 작성하여 사용가능

# 모듈 불러오기 문법
# -파이썬에서는 import문을 사용해 세 가지 방식으로 모듈을 불러올 수 있음
# 방법1. import 모듈명
# 방법2. from 모듈명 import *
# 방법3. from 모듈명 import 함수명 또는 클래스명
# * import문은 코드의 어느 위치에서라도 사용할 수 있지만, 통상적으로 코드의 맨 위에 위치하는 것이 좋음
# 방법1과 방법2는 모두 해당 모듈 전체를 불러옴
# 방법1과 모듈에 포함된 변수나 함수를 사용할 때마다 매번 모듈명과 함께 닷.연산자를 사용해야 하지만,
# 방법2는 변수명이나 함수명만으로도 간편하게 사용할 수 있음

# 예제 방법1. import 모듈명 <-- 방법으로 math 모듈 사용해보기

# 파이썬에서 기본적으로 제공하는 수학관련 모듈인 math모듈을 불러와서 사용
import math

print(math.pi) # 3.141592...

print(math.pow(2,2)) # 4.0
# 만약 모듈명을 함께 사용하지 않으면 파이썬은 해당 변수나 함수가 정의되어 있지않아고 판단하여
# NameError를 발생 시킬 것
# print(pi)
# print(pow(2,2))

print("-----------------------------------------")

# 예제 방법2. from 모듈명 import * <---- 방법으로 math모듈 사용해보기
from math import *
print(pi)
# 결론 : 방법2를 사용해 모듈명 없이 변수명이나 함수명 만으로도 간단하게 사용가능

print("-----------------------------------------")

# 예제 방법3. from 모듈명 import 함수명 또는 클래스명 <-- 방법으로 math모듈 사용

pi = "내가 정의한 변수"

from math import pi
print(pi)

# 결론 : 불러오는 모듈 안에 사용자가 직접 정의한 변수나 함수와 이름이 겹칠 가능성이 언제나 존재하기때문에
#       이와 같은 상황을 피하기 위해 import문을 언제나 코드의 맨앞에 위치 시키거나
#       필요한 변수나 함수만 불러와 사용하는 것이 좋다.

# 보충!
# - 모듈은 여러 변수와 함수를 가지고 있는 집합체로, 크게 표준모듈과 외부 모듈로 나뉨
# - 표준모듈이란? 파이썬에서 기본적으로 내장되어있는 모듈
# - 외부모듈이란? 다른 사람들이 만들어서 공개한 모듈
# - 표준모듈의 종류
#    random, sys, os, datetime, time, math, urllib , turtle

# - 외부모듈의 종류
#    requests, BeautifulSoup, Numpy, Matplotlib, pandas
