
# 변수란?
# 자료형의 값을 저장하는 메모리 공간


# 변수 메모리공간 만들기 문법
# 변수이름 = 변수에 저장할 값
a =1
b = "phthon"
c = [1,2,3]

# a 변수가 가리키는 메모리의 주소를 확인하는 방법
a = [1,2,3]
# id함수는 변수가 가리키고 잇는 객체의 주소값을 돌려주는 파이썬 내장함수
print(id(a)) # [1,2,3]리스트의 메모리 주소값을 출력

# 리스트를 복사할때
# b변수에 a변수를 대입하면 b는 a와 완전히 동일하다고 할 수 있다.
# 다만 [1,2,3]리스트를 참조하는 변수가 1개에서 2개로 늘어났다는 차이가 있다.
a = [1,2,3]
b=a
print(id(a))
print(id(b)) # a변수와 b변수는 똑같은 주소값을 가진다. (두 변수가 가리키는 대상의 메모리주소가 동일하다)

# 각변수는 동일한 객체를 가리키고 있는지 판단하는 파이썬 명령어
# is함수
a = [1,2,3]
b=a
print(a is b)

# b변수를 생성할때 a변수의 값을 가져오면서 a와는 다른 주소를 가리키도록 만드는 방법
    # 첫번째 방법 -> 리스트 전체를 가리키는 [:] 사용해서 복사
a = [1,2,3]
b = a[:]
a[1] = 4 # [1,2,3]중에서 인덱스1 위치에 4를 넣어 덮어쓰기
print(a)
print(b)
# 결론 : a리스트 값을 바꾸더라도 b리스트에는 영향을 끼치지않는다.

    # 두번째 방법 -> copy모듈을 사용하는 방법
from copy import copy # 모듈 내부에 존재하는 copy()함수를 불러서 사용
a = [1,2,3]
b = copy(a) # 리스트a의 처음 요소부터 끝요소까지 슬라이싱
            # b = copy(a) 코드는 b = a[:]와 동일
a[1] = 4
print(a)
print(b)